function modifiedJjencode(jsCode) {
    let r = '';
    let b = ['ꓽꓽꓽ', 'ꓽꓽᱺ', 'ꓽᱺꓽ', 'ꓽᱺᱺ', 'ᱺꓽꓽ', 'ᱺꓽᱺ', 'ᱺᱺꓽ', 'ᱺᱺᱺ', 'ᱺꓽꓽꓽ', 'ᱺꓽꓽᱺ', 'ᱺꓽᱺꓽ', 'ᱺꓽᱺᱺ', 'ᱺᱺꓽꓽ', 'ᱺᱺꓽᱺ', 'ᱺᱺᱺꓽ', 'ᱺᱺᱺᱺ'];
    let s = '';
    for (let i = 0; i < jsCode.length; i++) {
        let n = jsCode.charCodeAt(i);
        if (n === 0x22 || n === 0x5c) {
            s += `\\\\\\${jsCode.charAt(i).toString(16)}`;
        } else if ((0x21 <= n && n <= 0x2f) || (0x3A <= n && n <= 0x40) || (0x5b <= n && n <= 0x60) || (0x7b <= n && n <= 0x7f)) {
            s += jsCode.charAt(i);
        } else if ((0x30 <= n && n <= 0x39) || (0x61 <= n && n <= 0x66)) {
            if (s) r += `\'${s}\'+`;
            r += `ᱺ.${b[n < 0x40 ? n - 0x30 : n - 0x57]}+`;
            s = '';
        } else if (n === 0x6c) {
            if (s) r += `\'${s}\'+`;
            r += '(![]+\'\')[ᱺ.ꓽᱺꓽ]+';
            s = '';
        } else if (n === 0x6f) {
            if (s) r += `\'${s}\'+`;
            r += 'ᱺ.ꓽᱺ+';
            s = '';
        } else if (n === 0x74) {
            if (s) r += `\'${s}\'+`;
            r += 'ᱺ.ꓽꓽ+';
            s = '';
        } else if (n === 0x75) {
            if (s) r += `\'${s}\'+`;
            r += 'ᱺ.ꓽ+';
            s = '';
        } else if (n < 128) {
            if (s) r += `\'${s}`;
            else r += '\'';
            r += `\\\\\'+${n.toString(8).replace(/[0-7]/g, c => `ᱺ.${b[c]}+`)}`;
            s = '';
        } else {
            if (s) r += `\'${s}`;
            else r += '\'';
            r += `\\\\\'+ᱺ.ꓽ+${n.toString(16).replace(/[0-9a-f]/gi, c => `ᱺ.${b[parseInt(c, 16)]}+`)}`;
            s = '';
        }
    }
    if (s) r += `\'${s}\'+`;

    return `ᱺ=+[],ᱺ={ꓽꓽꓽ:ᱺ,ᱺᱺᱺᱺ:(![]+'')[ᱺ],ꓽꓽᱺ:++ᱺ,ᱺꓽᱺꓽ:(![]+'')[ᱺ],ꓽᱺꓽ:++ᱺ,ᱺꓽᱺᱺ:({}+'')[ᱺ],ᱺᱺꓽᱺ:(ᱺ.ᱺ+'')[ᱺ],ꓽᱺᱺ:++ᱺ,ᱺᱺᱺꓽ:(!''+'')[ᱺ],ᱺꓽꓽ:++ᱺ,ᱺꓽᱺ:++ᱺ,ᱺᱺꓽꓽ:({}+'')[ᱺ],ᱺᱺꓽ:++ᱺ,ᱺᱺᱺ:++ᱺ,ᱺꓽꓽꓽ:++ᱺ,ᱺꓽꓽᱺ:++ᱺ},ᱺ.ᱺꓽ=(ᱺ.ᱺꓽ=ᱺ+'')[ᱺ.ᱺꓽᱺ]+(ᱺ.ꓽᱺ=ᱺ.ᱺꓽ[ᱺ.ꓽꓽᱺ])+(ᱺ.ᱺᱺ=(ᱺ.ᱺ+'')[ᱺ.ꓽꓽᱺ])+((!ᱺ)+'')[ᱺ.ꓽᱺᱺ]+(ᱺ.ꓽꓽ=ᱺ.ᱺꓽ[ᱺ.ᱺᱺꓽ])+(ᱺ.ᱺ=(!''+'')[ᱺ.ꓽꓽᱺ])+(ᱺ.ꓽ=(!''+'')[ᱺ.ꓽᱺꓽ])+ᱺ.ᱺꓽ[ᱺ.ᱺꓽᱺ]+ᱺ.ꓽꓽ+ᱺ.ꓽᱺ+ᱺ.ᱺ,ᱺ.ᱺᱺ=ᱺ.ᱺ+(!''+'')[ᱺ.ꓽᱺᱺ]+ᱺ.ꓽꓽ+ᱺ.ꓽ+ᱺ.ᱺ+ᱺ.ᱺᱺ,ᱺ.ᱺ=(ᱺ.ꓽꓽꓽ)[ᱺ.ᱺꓽ][ᱺ.ᱺꓽ],ᱺ.ᱺ(ᱺ.ᱺ(ᱺ.ᱺᱺ+'\\''+${r}'\\'')())()`;
}